[
 {
  "name": "g_d3_f50",
  "rowTexts": [
   "Nuclear Physics A 00 (2018) 1–7"
  ]
 },
 {
  "name": "g_d3_f51",
  "rowTexts": [
   "Nuclear",
   "Physics A"
  ]
 },
 {
  "name": "g_d3_f50",
  "rowTexts": [
   "www.elsevier.com"
  ]
 },
 {
  "name": "g_d3_f52",
  "rowTexts": [
   "/"
  ]
 },
 {
  "name": "g_d3_f50",
  "rowTexts": [
   "locate"
  ]
 },
 {
  "name": "g_d3_f52",
  "rowTexts": [
   "/"
  ]
 },
 {
  "name": "g_d3_f50",
  "rowTexts": [
   "procedia",
   "XXVIIth International Conference on Ultrarelativistic Nucleus-Nucleus Collisions",
   "(Quark Matter 2018)",
   "The Future of High-Energy Heavy-Ion Facilities",
   "Jan Fiete Grosse-Oetringhaus"
  ]
 },
 {
  "name": "g_d3_f53",
  "rowTexts": [
   "CERN, 1211 Geneva 23, Switzerland"
  ]
 },
 {
  "name": "g_d3_f54",
  "rowTexts": [
   "Abstract"
  ]
 },
 {
  "name": "g_d3_f50",
  "rowTexts": [
   "The plans within the next decade of the high-energy heavy-ion facilities RHIC at BNL and LHC at CERN are reviewed",
   "in detail, focusing on the physics programme for"
  ]
 },
 {
  "name": "g_d3_f55",
  "rowTexts": [
   "√"
  ]
 },
 {
  "name": "g_d3_f53",
  "rowTexts": [
   "s"
  ]
 },
 {
  "name": "g_d3_f50",
  "rowTexts": [
   "NN"
  ]
 },
 {
  "name": "g_d3_f55",
  "rowTexts": [
   "≥"
  ]
 },
 {
  "name": "g_d3_f50",
  "rowTexts": [
   "200 GeV. The expected data samples are presented, together",
   "with a discussion of the physics programme and reach. Selected performance studies are presented. An outlook is given",
   "on the plans with these and new facilities beyond 2030."
  ]
 },
 {
  "name": "g_d3_f53",
  "rowTexts": [
   "Keywords:"
  ]
 },
 {
  "name": "g_d3_f50",
  "rowTexts": [
   "Quark-gluon plasma, high-energy, heavy ions, future, LHC, RHIC, FCC"
  ]
 },
 {
  "name": "g_d3_f54",
  "rowTexts": [
   "1. Introduction"
  ]
 },
 {
  "name": "g_d3_f50",
  "rowTexts": [
   "Initially the field of heavy-ion physics searched for a new state of matter,  the Quark–Gluon Plasma",
   "(QGP). Following its discovery, a precise characterization of the observed hot and dense medium followed",
   "which is still ongoing today.  Nowadays, the main open questions are on the one hand the question of the",
   "underlying dynamics of the medium, its degrees of freedom and the microscopic structure.  Can one find a",
   "model which describes at the same time the long wavelength (ideal fluid) behaviour and the short wavelength",
   "(quenching) behaviour? On the other hand, the discovery of e"
  ]
 },
 {
  "name": "g_d3_f52",
  "rowTexts": [
   "ff"
  ]
 },
 {
  "name": "g_d3_f50",
  "rowTexts": [
   "ects usually associated with a hot and dense",
   "medium in p–Pb, d–Au,",
   "3",
   "He–Au, and smaller systems down to pp, asks the question of the onset of the QGP",
   "as a function of system size.  The observations challenge two paradigms at once: a) down to which system",
   "size does the currently successful theoretical description of heavy-ion collisions remain valid; and b) can",
   "the standard tools for minimum-bias pp physics remain standard? Finding a solution to these questions may",
   "be the key to finding a universal description of the underlying physics of non-perturbative QCD.",
   "The next decade of heavy-ion physics at high energy will use rare probes to understand the inner work-",
   "ings and the onset of the QGP. This aim is achieved by upgrading the accelerators and in particular the de-",
   "tectors to study one to two orders of magnitude more collisions than currently achievable. The programme",
   "using rare probes builds on several distinct pillars:",
   "1.  the study of charm and beauty, in particular at low"
  ]
 },
 {
  "name": "g_d3_f53",
  "rowTexts": [
   "p"
  ]
 },
 {
  "name": "g_d3_f50",
  "rowTexts": [
   "T",
   ", which are produced in the initial hard scattering",
   "and travel through the entire medium like Brownian motion markers;",
   "2.  the study of low-mass dielectrons as a window to signs of chiral-symmetry restoration and thermal",
   "radiation;"
  ]
 },
 {
  "name": "Times",
  "rowTexts": [
   "arXiv:1812.02623v1  [nucl-ex]  6 Dec 2018"
  ]
 }
]
